# ExportElementIds Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..ExportElementIds Property
NavisworksExportOptions Class See Also
---
True to export Revit element ids, false to skip these values. Default value is true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ExportElementIds { get; set; }
```

Visual Basic
---
```text
Public Property ExportElementIds As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportElementIds {
	bool get ();
	void set (bool value);
}
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace